04_tests/stress/results/performance-2026-09-02/monolith/hotel-order-run1-k6.stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: hotel-order.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * hotel_order: 1 iterations for each of 50 VUs (maxDuration: 2m0s, gracefulStop: 30s)


Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

running (0m06.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
hotel_order   [   0% ] 50 VUs  0m00.9s/2m0s  00/50 iters, 1 per VU


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 100     15.333525/s
    checks_succeeded...: 100.00% 100 out of 100
    checks_failed......: 0.00%   0 out of 100

    ✓ status is 200
    ✓ order created or business-rejected

    CUSTOM
    business_success...............: 1      0.153335/s

    HTTP
    http_req_duration..............: avg=299.95ms min=4.12ms med=136.27ms max=994ms p(90)=811.94ms p(95)=866.31ms
      { expected_response:true }...: avg=299.95ms min=4.12ms med=136.27ms max=994ms p(90)=811.94ms p(95)=866.31ms
    http_req_failed................: 0.00%  0 out of 200
    http_reqs......................: 200    30.667049/s

    EXECUTION
    iteration_duration.............: avg=1.3s     min=1.07s  med=1.32s    max=1.43s p(90)=1.41s    p(95)=1.42s   
    iterations.....................: 50     7.666762/s
    vus............................: 50     min=0        max=50
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 134 kB 21 kB/s
    data_sent......................: 41 kB  6.3 kB/s



running (0m06.5s), 00/50 VUs, 50 complete and 0 interrupted iterations
hotel_order ✓ [ 100% ] 50 VUs  0m01.4s/2m0s  50/50 iters, 1 per VU