04_tests/stress/results/performance-2026-09-02/monolith/hotel-order-run2-k6.stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: hotel-order.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * hotel_order: 1 iterations for each of 50 VUs (maxDuration: 2m0s, gracefulStop: 30s)


Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

Run           [ 100% ] setup()
hotel_order   [   0% ]

running (0m06.0s), 49/50 VUs, 1 complete and 0 interrupted iterations
hotel_order   [   2% ] 50 VUs  0m00.9s/2m0s  01/50 iters, 1 per VU


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 100     15.55335/s
    checks_succeeded...: 100.00% 100 out of 100
    checks_failed......: 0.00%   0 out of 100

    ✓ status is 200
    ✓ order created or business-rejected

    CUSTOM
    business_success...............: 1      0.155533/s

    HTTP
    http_req_duration..............: avg=267.86ms min=4.01ms  med=108.2ms max=1.05s p(90)=754.9ms p(95)=801.51ms
      { expected_response:true }...: avg=267.86ms min=4.01ms  med=108.2ms max=1.05s p(90)=754.9ms p(95)=801.51ms
    http_req_failed................: 0.00%  0 out of 200
    http_reqs......................: 200    31.1067/s

    EXECUTION
    iteration_duration.............: avg=1.18s    min=793.9ms med=1.19s   max=1.33s p(90)=1.31s   p(95)=1.32s   
    iterations.....................: 50     7.776675/s
    vus............................: 49     min=0        max=49
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 134 kB 21 kB/s
    data_sent......................: 41 kB  6.4 kB/s



running (0m06.4s), 00/50 VUs, 50 complete and 0 interrupted iterations
hotel_order ✓ [ 100% ] 50 VUs  0m01.3s/2m0s  50/50 iters, 1 per VU